{
  "id": "2014cvprHoffman",
  "authors": "Judy Hoffman,  Trevor Darrell,  Kate Saenko",
  "title": "Continuous Manifold Based Adaptation for Evolving Visual Domains",
  "venue": "cvpr",
  "year": "2014",
  "pdf": "pdfs/Hoffman_CVPR2014.pdf",
  "slides": "",
  "code": "",
  "bibtex_type": "inproceedings",
  "fig": "figs/2014cvprHoffman.jpg",
  "project": "http://cma.berkeleyvision.org/",
  "is_new": false,
  "special": "",
  "video": "videos/2014-cvpr-hoffman.mp4",
  "abstract": "We pose the following question: what happens when test data not only differs from training data, but differs from it in a continually evolving way? The classic domain adaptation paradigm considers the world to be separated into stationary domains with clear boundaries between them. However, in many real-world applications, examples cannot be naturally separated into discrete domains, but arise from a continuously evolving underlying process. Examples include video with gradually changing lighting and spam email with evolving spammer tactics. We formulate a novel problem of adapting to such continuous domains, and present a solution based on smoothly varying embeddings. Recent work has shown the utility of considering discrete visual domains as fixed points embedded in a manifold of lower-dimensional subspaces. Adaptation can be achieved via transforms or kernels learned between such stationary source and target subspaces. We propose a method to consider non-stationary domains, which we refer to as Continuous Manifold Adaptation (CMA). We treat each target sample as potentially being drawn from a different subspace on the domain manifold, and present a novel technique for continuous transform-based adaptation. Our approach can learn to distinguish categories using training data collected at some point in the past, and continue to update its model of the categories for some time into the future, without receiving any additional labels. Experiments on two visual datasets demonstrate the value of our approach for several popular feature representations.",
  "month": 6
}